LC1WithoutExtensionFilled/0/blueprints/wall_friction/alpha.water.1
    {
        type            zeroGradient;
    }
