LC1WithoutExtensionFilled/0/blueprints/wall_friction/p_rgh.1
    {
        type            zeroGradient;
    }

